[
{

    "cat": "acronyms",
    "terms": {
        "CTPS": "Confirmed transactions per second",
        "DAG": "Directed acyclic graph",
        "MWM": "Minimum weight magnitude",
        "PoW": "Proof of work",
        "TPS": "Transactions per second",
        "W-OTS": "Winternitz one-time signature"
    
    }

},
{
    "cat": "cryptography",
    "terms": {
        "Curl": "Hashing function, designed for the Internet of things, that uses the SHA-3 sponge-based construction.",
        "Kerl": "Ternary version of the Keccek-384 hashing function that takes a 48 byte input and produces a 243 trit output, using [two's complement](https://en.wikipedia.org/wiki/Two%27s_complement).",
        "Winternitz one-time signature": "Quantum-resistant signature scheme that's used to sign transactions that withdraw IOTA tokens."

    }

},
{
    "cat": "tangle",
    "terms": {
        "blowball": "Tangle formation where a majority of tip transactions reference one central transaction.",
        "subgraph": "Section of the ledger that contains all transactions between a milestone transaction and tip transactions",
    }

},
{
    "cat": "transactions",
    "terms": {
        "child": {
            "definition": "Transaction that directly references two other transactions.",
            "pos": "noun",
            "status": "preferred"
        },
        "confirmed": {
            "definition": "State of a transaction when it's been approved by a milestone",
            "pos": "adjective",
            "status": "preferred"
        },
        "depth": {
            "definition": "Entry milestone that's used to start tip selection through a subgraph.",
            "pos": "noun",
            "status": "preferred"
        },
        "future set": "Group of transactions that approve the same transaction.",
        "inconsistent": "State of a transaction when it leads to a negative balance of IOTA tokens",
        "inclusion": "State of a transaction that's been referenced by given tip transactions or a milestone transaction",
        "invalid": "State of a transaction when it's either non-solid, inconsistent, or it references a transaction that's too old",
        "milestone": "Valid transaction that's created by the Coordinator. IRI nodes use milestones to determine if transactions are confirmed.",
        "minimum weight magnitude": "Integer that sets the amount of work that will be carried out on a transaction hash during PoW. The solution to the computational puzzle is a transaction hash that contains the same number of trailing nines as the MWM.",
        "parent": "Transaction that is directly referenced by a child transaction",
        "pending": "State of a transaction when it's been seen by the network, but not yet confirmed",
        "reattach": "Recreate and resend a transaction by requesting new tip transactions, recalculating the transaction and bundle hashes, signing any value transactions, and doing proof of work",
        "rebroadcast": "Send the same transaction to a node again",
        "solid": "State of a transaction when an IRI node has its entire history (all directly and indirectly referenced transactions) in its ledger",
        "tail transaction": "Transaction 0 in a bundle. IRI nodes contruct and validate bundles by traversing the trunk transaction of each tail transaction.",
        "tip selection": "Process whereby a node selects two tip transactions from the Tangle",
        "tip transaction": "Transaction with no children",
    }
}

},
{
    "cat": "ternary",
    "terms": {
        "ternary": "Base-3 numeral system",
        "trit": "Digit in a ternary number system. Trits are often represented by 1, 0, -1.",
        "tryte": "A tryte is 3 trits which can represent 27 values"

    }

}
]


